---
layout: home
---

# Xwindow

유닉스와 유닉스 계통 운영 체제에서 사용되는 윈도우 시스템

일반적으로 "X11" 또는 "X"로도 알려져 있다

여러 가지 그래픽 요소(창, 버튼, 메뉴 등)을 생성하고 조작할 수 있는 API를 제공

![Untitled](xwindow%203180c69d652a4c8195cd87a310b12c6b/Untitled.png)

[https://t1.daumcdn.net/cfile/tistory/997D86455E5528A30A](https://t1.daumcdn.net/cfile/tistory/997D86455E5528A30A)

### 특징

- X Window System은 GUI 응용 프로그램을 작성하고 실행하는 데 사용되며, 네트워크를 통해 다른 컴퓨터와 통신 가능
- X Window System은 클라이언트-서버 아키텍처를 사용하여 실행되며, X 서버는 디스플레이를 관리하고 클라이언트 애플리케이션은 X 서버를 통해 디스플레이에 그래픽을 출력
- X Window System은 오픈 소스이며, 다양한 운영 체제에서 사용

### 아키텍처

X윈도우는 윈도우 GUI와 다르게 네트워크 프로토콜에 기반한 그래픽 사용자 인터페이스

클라이언트 - 서버 모델을 기반으로 하고 있는데, 마우스를 움직이면 마우스 포인터를 옮기라는 명령을 네트워크를 통해 X서버에 보내고, X서버가 명령을 요청받아 응용 프로그램에서 마우스 포인터의 위치를 이동 시켜주는 원리

따라서 **디스플레이 장치에 독립적**이다

→ 디스플레이 장치에 의존적이지 않아 다양한 종류의 컴퓨터에서 구동될 수 있을 정도로 이식성이 뛰어나다

또한 X윈도우 시스템은 사용자 인터페이스 모습에 관여하지 않는 다는 특징을 가지고 있어 X윈도우를 이용한 사용자 환경은 매우 다양하다. 

### 관련 명령어

- xhost: X서버가 호스트 접근 제어를 하기 위해 사용하는 명령어. X윈도우에서 xterm과 같은 X응용프로그램은 X서버에게 자신을 표현해 줄 디스플레이를 요청
- startx: X윈도우를 실행시키는 스크립트로 시스템 환경을 초기화 시키고 시작하는데 필요한 프로그램들을 호출하고, 최종적으로 xinit을 호출
- xterm: X윈도우 시스템을 위한 표준 단말 에뮬레이터
- xauth: .Xauthority 파일의 쿠키 내용을 추가, 삭제, 리스트를 출력하는 유틸리티

**X 윈도우 기반 데스크톱**

- GNOME
- KDE
- Xfce
- LXDE
- Cinnamon - GNOME 3 기반
- MATE - GNOME 2 기반